# ConstructionName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ConstructionName Property
ParameterTypeId Class See Also
---
"Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ConstructionName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConstructionName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConstructionName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace